cmsis-svd/cmsis-svd/data/Fujitsu/MB9AF14xL.xml
        <!-- REGISTER "IRQ15MON" -->
        <register>
          <name>IRQ15MON</name>
          <description>IRQ15 Batch Read Register</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT" -->
            <field>
              <name>MFSINT</name>
              <description>Reception interrupt request on MFS ch.4</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ16MON" -->
        <register>
          <name>IRQ16MON</name>
          <description>IRQ16 Batch Read Register</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT1" -->
            <field>
              <name>MFSINT1</name>
              <description>Status interrupt request on MFS ch.4</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MFSINT0" -->
            <field>
              <name>MFSINT0</name>
              <description>Transmission interrupt request on MFS ch.4</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ17MON" -->
        <register>
          <name>IRQ17MON</name>
          <description>IRQ17 Batch Read Register</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT" -->
            <field>
              <name>MFSINT</name>
              <description>Reception interrupt request on MFS ch.5</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ18MON" -->
        <register>
          <name>IRQ18MON</name>
          <description>IRQ18 Batch Read Register</description>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT1" -->
            <field>
              <name>MFSINT1</name>
              <description>Status interrupt request on MFS ch.5</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MFSINT0" -->
            <field>
              <name>MFSINT0</name>
              <description>Transmission interrupt request on MFS ch.5</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ19MON" -->
        <register>
          <name>IRQ19MON</name>
          <description>IRQ19 Batch Read Register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT" -->
            <field>
              <name>MFSINT</name>
              <description>Reception interrupt request on MFS ch.6</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ20MON" -->
        <register>
          <name>IRQ20MON</name>
          <description>IRQ20 Batch Read Register</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT1" -->
            <field>
              <name>MFSINT1</name>
              <description>Status interrupt request on MFS ch.6</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MFSINT0" -->
            <field>
              <name>MFSINT0</name>
              <description>Transmission interrupt request on MFS ch.6</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ21MON" -->
        <register>
          <name>IRQ21MON</name>
          <description>IRQ21 Batch Read Register</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT" -->
            <field>
              <name>MFSINT</name>
              <description>Reception interrupt request on MFS ch.7</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ22MON" -->
        <register>
          <name>IRQ22MON</name>
          <description>IRQ22 Batch Read Register</description>
          <addressOffset>0x6C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT1" -->
            <field>
              <name>MFSINT1</name>
              <description>Status interrupt request on MFS ch.7</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MFSINT0" -->
            <field>
              <name>MFSINT0</name>
              <description>Transmission interrupt request on MFS ch.7</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
